In [1]:
import pandas as pd

### Let's make dummy data frame

In [2]:
dummy_df = pd.DataFrame()
dummy_df['col1'] = [10, 12, 14, None, 15, 19]
dummy_df['col2'] = [12, 34, 2, 34, None, None]
dummy_df['col3'] = [13, 23, 8, 2, 1, 4]

In [3]:
dummy_df

   col1  col2  col3
0  10.0  12.0    13
1  12.0  34.0    23
2  14.0   2.0     8
3   NaN  34.0     2
4  15.0   NaN     1
5  19.0   NaN     4

In [4]:
ddf = dummy_df.dropna(axis=1)

In [5]:
ddf

   col3
0    13
1    23
2     8
3     2
4     1
5     4

In [6]:
rrf = dummy_df.dropna(axis=0)

In [7]:
rrf

   col1  col2  col3
0  10.0  12.0    13
1  12.0  34.0    23
2  14.0   2.0     8

### `isna()`

In [ ]:
dummy_df.isna()

In [ ]:
def check_for_nan(dframe):
    """
    dframe â†’ pandas data frame object
    returns `nan_places` a dictionary of column names and the `nan_indices`
    """
    nan_frame = dframe.isna()
    d_cols = dframe.columns
    
    nan_places = {}
    for col in d_cols:
        col_lvals = nan_frame[col].to_list()
        nan_indices = [index for index, val in enumerate(col_lvals) if val == True]
        if nan_indices:
            nan_places[col] = nan_indices
        else:
            nan_places[col] = None
    
    return nan_places

In [ ]:
check_for_nan(dframe=dummy_df)

### `info()`

In [ ]:
dummy_df.info()

In [ ]:
dummy_frame = pd.DataFrame()
dummy_frame['col1'] = [10, '12', 14, None, 15, 19]
dummy_frame['col2'] = [12, 34, 2, 34, None, None]
dummy_frame['col3'] = [13, 23, None, 2, 1, 4]

In [ ]:
dummy_frame.info()